[
{"topic":"electronics","question":"What is the effective differencial effective of this circuit","excerpt":"I'm trying to work out, in general terms, the effective capacitance of this circuit (see diagram: http://i.stack.imgur.com/BS85b.png).  \n\nWhat is the effective capacitance of this circuit and will the ...\r\n        "},
{"topic":"electronics","question":"Heat sensor with fan cooling","excerpt":"Can I know which component senses heat or acts as heat sensor in the following circuit?\nIn the given diagram, it is said that the 4148 diode acts as the sensor. But basically it is a zener diode and ...\r\n        "},
{"topic":"electronics","question":"Outlet Installation--more wires than my new outlet can use [on hold]","excerpt":"I am replacing a wall outlet with a Cooper Wiring USB outlet (TR7745).  The new outlet has 3 wires coming out of it--a black, a white, and a green.  Each one needs to be attached with a wire nut to ...\r\n        "},
{"topic":"electronics","question":"Buck Converter Operation Question","excerpt":"i have been reading about the buck converter, and have also referred to the various online resources like here.\n\n\n\nIn the above circuit, as I understand, when switch closes, current starts to increase ...\r\n        "},
{"topic":"electronics","question":"Urgent help in area of ASIC design, verification, SoC [on hold]","excerpt":"I need help with deciding on a Master's Project and I need some ideas related to the field of ASIC Design/ verification or something related to SoC's, FPGA and or combination. I wish to pursue the ...\r\n        "},
{"topic":"electronics","question":"Slowly supplying power to a very high load","excerpt":"Is it possible to supply power to a very high load within a huge time range?\n\nThis question particularly regards MOSFETs.\nI know that a MOSFET must switch fast so that a little power would develop ...\r\n        "},
{"topic":"electronics","question":"I have a 110 VAC solenoid and want to know what kind of circuit i should build to control it from my microcontroller?","excerpt":"My solenoid is part of an old espresso machine, the circuit that detected low water level died and i can't replace it. I am adding a micro-controller to remotely turn it on and off and to control this ...\r\n        "},
{"topic":"electronics","question":"Can't read user-defined configuration space pci-express IP Virtex 6 Xilinx in testbench","excerpt":"I use IP core PCI-E for Virtex-6 v.2.5\n\nThere  is configuration space in PCI-E\n\nIt divides on standart space of PCI-E and vendor-specified or user-defined configuration space.\n\nThere are two types of ...\r\n        "},
{"topic":"electronics","question":"Understanding specs of PNP transistor for replacement","excerpt":"I want to replace an ON Semicondutor BC557 PNP transistor with a Multicomp BC557 PNP transistor. It is just for general switching of LEDs. But the specs look different although they are same mode. \n\n...\r\n        "},
{"topic":"electronics","question":"MCU crystal capacitor selection","excerpt":"I will be using the AT32UC3C2512C, the AVR32768 Application note recommends 22pF capacitors for crystals up to 16MHz...I will be using a 20MHz crystal, should I choose a 22pF or a 15pF loading ...\r\n        "},
{"topic":"electronics","question":"Manually recharging an ipad battery [on hold]","excerpt":"So I had an old gen 1 ipad that my son tried to clean with windex and ended up nuking it. \n\nI figured what the heck and tore it apart. Inside I struck gold with a 24k mAh battery. The problem is how ...\r\n        "},
{"topic":"electronics","question":"Wr703n Soldered Serial line, might have burned something [on hold]","excerpt":"I flashed the router with OpenWRT and it worked fine.\n\nThen I opened it to wire a serial line.(like this: ...\r\n        "},
{"topic":"electronics","question":"Solar panel not charging battery","excerpt":"I posted a similar question a while ago and got the answer I thought I was looking for but I now have a new multimeter so I'm able to get readings that should be of some use.\n\nI have a solar panel, ...\r\n        "},
{"topic":"electronics","question":"Device labeled 220/230V, 50Hz, 35V-A. What wattage do I need to have on voltage converter? [on hold]","excerpt":"I need to buy a voltage converter(adapter) for device I purchased in Europe and plan to use in USA.\n It's label says: 220/230V, 50Hz, 35V-A.  \n\nWhat wattage do I need to have on voltage converter 110V ...\r\n        "},
{"topic":"electronics","question":"_delay_ms not working with ATmega 16/32","excerpt":"I had purchased an ATMEGA 16 microcontroller and chaged its fuse bits settings and used internal caliberated RC clock with 1000000.\nChanges done in make file and F_CPU. But it do nothing.\n\nProgramme ...\r\n        "},
{"topic":"electronics","question":"Is it alright if I'll just connect the black and red wires intended for the my AVR's broken switch? [on hold]","excerpt":"My computer AVR's switch just got broken. Do you think is it alright if I'll just connect those 2 wires (red and black) together instead of tapping them to the broken switch's pins?\n\nSorry, I'm really ...\r\n        "},
{"topic":"electronics","question":"Proper way to monitor temperature of a surface?","excerpt":"I'm looking into creating a solution to monitor the temperature of a chip which has no temperature sensing available for me to use. I would like to use some sort of simple through-hole temperature ...\r\n        "},
{"topic":"electronics","question":"AttatchInterrupt Constantly interrupts","excerpt":"I am a new to electronics. I am trying to setup the radio control for the arduino. I hooked up the Reciever's Channel 1 to the Arduino Mega 2560's Digital pin 2, Reciever Vin to Arduino 5V, and Ground ...\r\n        "},
{"topic":"electronics","question":"RF power envelope","excerpt":"If I have an oscillator at 10 kHz outputting 5 W, using AM, like this.\n\n\n\nWhere does the power in the sidebands come from?\n Is the power the result of the harmonic relationship between the carrier and ...\r\n        "},
{"topic":"electronics","question":"how do you hook into a live stream of 802.15.4 packets? [on hold]","excerpt":"Using a packet sniffer I am able to detect and successfully read a \"hello word\" payload within an 802.15.4 frame.  \n\nIt's great can see the frames in the sniffer, but now I'm at the point where I ...\r\n        "},
{"topic":"electronics","question":"Functional Unit and Micro-operations Schematics","excerpt":"I'm sitting an exam on Computer Architecture in a few days and i'm stuck on a particular type of question.\n\nI'm asked to:\n\nProvide a detailed schematic for a functional unti that implements the ...\r\n        "},
{"topic":"electronics","question":"Collecting best CAD software for drawing electronics and electroenergetics schemes [duplicate]","excerpt":"Our school decided to go and buy some good CAD software for the students and teachers so that we make the electronics, electroenergetics... to the next level. \n\nWe are looking for a program that ...\r\n        "},
{"topic":"electronics","question":"What decides the range of FM band?","excerpt":"I read that the frequencies over which FM signals can be transmitted is limited between 88 MHz and 108 MHz. Why is it confined to a particular range and why specifically to this (88 MHz to 108 MHz) ...\r\n        "},
{"topic":"electronics","question":"Is possible use driver and receiver from different RS232 IC?","excerpt":"I need RS232 IC with Features: power supply 3.3v, ESD protection, 8-drivers/8-receivers.  I'm looking for ic with these specifications are not found. \n\nThese needs can be met if I use two IC is ...\r\n        "},
{"topic":"electronics","question":"Can I sell a CSA approved product in the US at retail or over the internet?","excerpt":"I have a product that was designed to sell in the RV market.  The RV industry does not require require UL per se, just a \"recognized listing\" which can be from a number of agencies including CSA (to ...\r\n        "},
{"topic":"electronics","question":"Is it possible to modify an HDMI/coax/PC video signal?","excerpt":"My apologies in advance if this is not a good question.  I'm new to this portion of StackExchange, and I'm just trying to find out if something is possible and I'm doing research.\n\nIs it possible to ...\r\n        "},
{"topic":"electronics","question":"Node transmission per hour","excerpt":"I'm struggling a bit with the following calculation:\nA sensor node has a duty cycle of 5% and draws a current of 1.55mA while in active part of duty cycle. It is negligible while in the inactive part ...\r\n        "},
{"topic":"electronics","question":"Surface Mount LEDs that are similar to these through hole LEDs (link in the post) [on hold]","excerpt":"I am looking for surface mount LEDs that have the same physical characteristics as these through hole LEDs.\n\n\n\n...\r\n        "},
{"topic":"electronics","question":"Do computers speed up at higher temperatures?","excerpt":"At higher temperatures, will computers get faster? Evidently, one always wants cool a computer down as higher temperatures can damage core components.\n\nHowever, is it an interplay between silicon, ...\r\n        "},
{"topic":"electronics","question":"AMD/Intel CPU Yield/Failure Rate","excerpt":"This question is based on another question submitted here: Is it possible to make illegal clones of an Intel Core i7?\n\nMore specifically, it's based around this quote:\n\n\n  I've been led to believe ...\r\n        "},
{"topic":"electronics","question":"Circuit to control a impulse solenoid valve from a movement detector","excerpt":"I have a movement detector sensor that generate a pulse (3.3V TTL) for 60 seconds when something moves in front of it. On the other hand, I have a impulse solenoid valve that close on a negative ...\r\n        "},
{"topic":"electronics","question":"Differential amplifier problem","excerpt":"I really can't determine what my professor meant by this. He wanted me to calculate parameters of BJT differential amplifier that will have -100 amplification for signals difference and -1 for their ...\r\n        "},
{"topic":"electronics","question":"Clocks setup when programming Atmel via ISP?","excerpt":"When programming an Atmel microchip over SPI (ISP), what external clocking do I have to provide to programee? Does it have to match programmer's internal clock frequency, or can be totally different ...\r\n        "},
{"topic":"electronics","question":"Questions Regarding Ground, Single Power Supply, &amp; Dual Power Supply","excerpt":"I need some help wrapping my brain around what ground, single supply, and dual power supplies physically look like in a circuit.\n\nI have an AC to DC wall adapter with a positive lead and a negative ...\r\n        "},
{"topic":"electronics","question":"USB to SPI line level converter","excerpt":"I have a quite powerful DSO, MSO2024 from Tektronix with SPI interpreter on board. \nAny idea to convert USB line levels to SPI so I can watch them with this scope?\n\r\n        "},
{"topic":"electronics","question":"How to improve I2C RTC accuracy","excerpt":"I´m using a PCF 8583 I2C RTC for one of my projects (i´m not a professional, just an amateur). The clock delays about an hour per day, which I find unacceptable. \n\nI´m using a 32768 Hz, 12.5 pf, 50 ...\r\n        "},
{"topic":"electronics","question":"add a rechargeable lipo to arduino micro project","excerpt":"I'm somewhat confused by the various options, hoping someone can clarify which breakout board I need. I want to build a prop that drives a bunch of neo pixel sticks. It should:\n\n\nhave a rechargeable ...\r\n        "},
{"topic":"electronics","question":"Make a prototype board using ARM core [on hold]","excerpt":"I'm a newbie here. I'm currently planning to make my own prototype board using an ARM chip. So I'll have to get the chip (which I have chosen to be SAM3S4A), and get some other components to support ...\r\n        "},
{"topic":"electronics","question":"Meaning of causal signal","excerpt":"What exactly does causal signal mean?\n\nCausality,as I see it is a property of a system wherein the output at PRESENT is dependent ONLY on PAST and PRESENT values of input.Here we have a reference of ...\r\n        "},
{"topic":"electronics","question":"VHDL: receive module randomly fails when counting bits","excerpt":"Background\n\nThis is a personal project; it regards connecting an FPGA to a N64, the byte values that the FPGA receives are then sent through UART to my computer. It actually functions pretty well! At ...\r\n        "},
{"topic":"electronics","question":"How to choose between ceramic and electrolytic capacitors","excerpt":"I was designing a circuit, I found a lot of datasheets that don't specify if the capacitor should be ceramic or electrolytic. So I started to wonder if the value of the capacitance would tell me the ...\r\n        "},
{"topic":"electronics","question":"LED Cube Driver Circuit - 2 Questions [duplicate]","excerpt":"I am going to build 8x8x8 LED cube. Before I do I need to figure out a good driver circuit. I came here because I have very little knowledge about how a lot electronic parts fit together.\n\nSo here's ...\r\n        "},
{"topic":"electronics","question":"PUT Base Resistors Question","excerpt":"simulate this circuit – Schematic created using CircuitLab\n\nI recently began in electronics and I was wondering why a Programmable Uni-junction Transistor needs two resistors \"connected\" ...\r\n        "},
{"topic":"electronics","question":"Step down switching regulator heating up with light loads","excerpt":"I built a step down switching regulator based on a Diodes AP5100 using the datasheet example circuit with this layout.  The voltage is being stepped down from 15V to 12V and the AP5100 is heating up ...\r\n        "},
{"topic":"electronics","question":"How to limit base current in transistor when collector current is unknown?","excerpt":"In the followig circuit I am trying to replace a push button with a transistor:\n\n\n\n\n\n\n\nsimulate this circuit – Schematic created using CircuitLab\n\nIn the schematic SW1 is the push button that ...\r\n        "},
{"topic":"electronics","question":"Is it possible to make a large-scale macro electronic processor that has no “micro” components? [on hold]","excerpt":"How possible is it to make a simple electronic circuit, even at home, to form logic gates, computation units for arithmetic, and the rest of the components that make a processor a \"processor\"?\n\nI am ...\r\n        "},
{"topic":"electronics","question":"usb daq device to rs232","excerpt":"We have a piece of data acquisition equipment (voltage data logger) that connects to a PC via a USB cable for power and communication. Because of some other equipment we already own, it would be ...\r\n        "},
{"topic":"electronics","question":"Build an H-Bridge Motor Driver with 4 N-Channel MOSFET","excerpt":"I have bought 4 N-Channel MOSFETs to build an H-Bridge Motor Driver.\nMy Motor drive and my power supply voltage is 12v.\nMy TTL logic voltage is 5v as I want to speed up/down the motor with uC PWM.\nNow ...\r\n        "},
{"topic":"electronics","question":"Is it better to study semiconductors before electronics devices? [on hold]","excerpt":"In my university I have no semiconductor course to study. They make us begin studying electronics devices right away (Topics in microelectronics by sedra). My question is should I study semiconductors ...\r\n        "},
{"topic":"electronics","question":"Does a conductor that is heavily negatively charged affect the number of free electrons or conductivity?","excerpt":"If a conductor is charged with several megavolts of static electricity, does it have a larger number of free electrons? If so, wouldn't they render the conductor more conductive?\n\nTo truly test the ...\r\n        "},
{"topic":"electronics","question":"What concepts in programming are useful in Electronics Engineering? [on hold]","excerpt":"I am studying Electronics Engineering. I only took two 3 programming courses. The first 2 are in c++ and I learnt up till pointers, classes and the basics of data structures. The third is mips ...\r\n        "},
{"topic":"electronics","question":"designing a “quite universal” half bridge?","excerpt":"A lot of power stuff run on H-bridges controlled by a MCU, would it be possible to design a half bridge and its integrated driver that would work on a very wide range of tension, like 10V to 250V on ...\r\n        "},
{"topic":"electronics","question":"How to detect neutral line of 220V AC line [on hold]","excerpt":"I need a little help on my new homework. I need a detector circuit which detects the neutral line of a 220V AC power line.\n\r\n        "},
{"topic":"electronics","question":"How to read Map-Report in FPGA Synthesis Tools","excerpt":"I have this Map-Report piece product by Lattice Diamond:\n\n...\r\n        "},
{"topic":"electronics","question":"What is “common-mode” noise?","excerpt":"Can someone explain what \"common-mode\" noise is, and how it can be problematic?\n\nI understand \"noise\" on a signal in general.  If I have a \"noisy\" +5V rail on a circuit board, I'm not going to be ...\r\n        "},
{"topic":"electronics","question":"What is the necessity of arc management in a circuit breaker?","excerpt":"Why is an arc management necessary in a circuit breaker?  \n\r\n        "},
{"topic":"electronics","question":"PCB Trace detection","excerpt":"I'm currently working on a Smart-card based application, we're worried about users sniffing the communication between the card and reader by inserting a skimming type device into our hardware and an ...\r\n        "},
{"topic":"electronics","question":"Calculate balance between signal and noise to allow 32 kbit/s transfer","excerpt":"I have to calculate proper balance/ratio between signal and noise ( S/N ) in decibels ( dB ), to be able to transfer data over the channel at 32 kbit/s. Channels bandwidth is 100 kHz.  \n\nI was given ...\r\n        "},
{"topic":"electronics","question":"RTK GPS POSITION ACCURARY- XYZ [on hold]","excerpt":"Kindly give me an elaborate description on RTK GPS !  HOw does it exactly calculate the exact elevation !! how do we cross the authenticity of the fixes ?\n\r\n        "},
{"topic":"electronics","question":"Synthesis of truncate function","excerpt":"I am using synplify, and wrote a utility library for my project, that contains the following function:\n\n...\r\n        "},
{"topic":"electronics","question":"Motor activation using MOSFET","excerpt":"I need to switch a motor on and off by cutting it's battery connection and even though I could use a relay, I would rather to use a MOSFET, so things will be smaller and quieter.\n\nThe problem is, I am ...\r\n        "},
{"topic":"electronics","question":"Finding timestamps of CAN messages received by a microcontroller","excerpt":"The microcontroller kit (STM32F4 discovery kit) which I am using has CAN and USB support. I want to program my microcontroller so that each time when a CAN message is received, it is transmitted via ...\r\n        "},
{"topic":"electronics","question":"Raspberry Pi / Arduino Button GPIO pins","excerpt":"I got myself a little button to start playing around with. Attempting to hook it up to a Rpi.\n\nWhat I wanted to confirm was the purpose and pins for each wire. The button I got is ...\r\n        "},
{"topic":"electronics","question":"Can you charge batteries in series? [on hold]","excerpt":"I am wondering if it is possible to charge batteries in series. I have a charger similar to https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcSx7HKYoPIqSW1ITif_RwDzEsAz9GjIqVlMX64S2PrVg9PX0xIs It ...\r\n        "},
{"topic":"electronics","question":"Switching and Zener Diodes","excerpt":"What's the difference between a Zener Diode and a Switching Diode? I.e: 1N4148 (switching) vs 1N5225 (zener).\n\r\n        "},
{"topic":"electronics","question":"Battery Power output [duplicate]","excerpt":"If  a battery has 100mA-hour rating will two batteries connected in series have also 100mA-hour rating but at double the voltage?\n\r\n        "},
{"topic":"electronics","question":"Compare SDG1025 with DG1022U [on hold]","excerpt":"siglent SDG1025\nrigol DG1022U\nWhich one is better?\n\r\n        "},
{"topic":"electronics","question":"How to select frequency resolution and window size in FFT?","excerpt":"I am doing spectrum analysis of a time varying signal with frequency changing from 200Hz to 10kHz. I am using the FFT for analyzing the frequency component in the signal. My questions are:\n\n\nHow to ...\r\n        "},
{"topic":"electronics","question":"Servo amplifier for DC motors","excerpt":"I have an Harmonic drive and would like to design a PLL (phase-locked loop) controller for speed control of it. Here is a block diagram of a motor-speed control system based on PLL techniques:\n\n\n\nMy ...\r\n        "},
{"topic":"electronics","question":"How do two DC motors of the same power but for different voltages differ in size?","excerpt":"Suppose I have two brushed DC motors, each rated 3000 RPM and 50 watts. One is rated for 18 volts and the other for 36 volts. How will their sizes differ?\n\nI assume that because of higher voltage the ...\r\n        "},
{"topic":"electronics","question":"Ideal location to practice soldering","excerpt":"Sounds like a stupid question, but really hasn't been asked before, or I haven't found a post about it. Either way, here it is:\n\nI bought a soldering iron recently and am looking for a place in my ...\r\n        "},
{"topic":"electronics","question":"Short-circuit transconductance [closed]","excerpt":"I find problems computing short circuit transconductance of this circuit\n\n\n\nRazavi's solution is made by inspection. I use small signal analysis and I can't draw a conclusion.\n\r\n        "},
{"topic":"electronics","question":"PWM LED dimmer as TE driver","excerpt":"Would it be possible to use a standard 12V DC LED dimmer together with a thermoelectric element to control the temperature? I'm talking about a very simple application with no need of fine tuning. ...\r\n        "},
{"topic":"electronics","question":"What is the purpose of the hole in the top of an LD1117V33?","excerpt":"I'm planning on using an LD1117V33 with input from the Raspberry Pi 5V rail (circuit diagram), and (maybe because this is my first electronics project) the hole at the top of the LD1117V33 makes me ...\r\n        "},
{"topic":"electronics","question":"Clock input signal to the instances from the top module","excerpt":"I have a top module ,everything it does is get inputs and outputs,define some wires and instantiate other modules.Every such module has a clock input.\nI am wondering if I should define a clock in the ...\r\n        "},
{"topic":"electronics","question":"Aluminum Electrolytic Capacitor Dissipation Factor","excerpt":"I am using a big aluminum electrolytic capacitor (400V/470uF/105°C) after a 220VAC bridge rectifier in a motor application.\n\nDuring the burn-in test (180VDC, 6A seen by the motor) with a constant ...\r\n        "},
{"topic":"electronics","question":"LTspice: How to make a time-variant mutual inductance coefficient in transformer model","excerpt":"I would like to make a transformer model with a time-variant mutual inductance coefficient. Does it work at (K1 L1 L2 var)?\n\r\n        "},
{"topic":"electronics","question":"through hole or SMD capacitor for high voltage powers [closed]","excerpt":"When TH and SMD caps are avalilable with same spec, which one to prefer for high voltage powers.?\n\r\n        "},
{"topic":"electronics","question":"USB hub with power delivery OR android accessory mode","excerpt":"I'm looking for a USB hub solution for small host computer (like a Raspberry Pi or Nexus tablet) that can simultaneously power/charge said host computer.\n\nI've heard about the USB power delivery ...\r\n        "},
{"topic":"electronics","question":"Safe to run a laptop in the dead space behind my desk? [closed]","excerpt":"I have a 13 inch laptop with a 1.5A power supply which I'm keeping under my desk (there's some dead space between my desk and the wall.) It's not a super tight space, there's a small crack at the top ...\r\n        "},
{"topic":"electronics","question":"How do I check a BJT transistor if it is still functional?","excerpt":"Is there a simple method to do a sanity check on a bipolar junction transistor whether it is still functional or defective?\n\n\n\n\n\n\n\nsimulate this circuit – Schematic created using CircuitLab\n\nSay ...\r\n        "},
{"topic":"electronics","question":"Bench Power Supply Failed","excerpt":"I just bought a 5-32 volt bench power supply with analog volt and amp displays yesterday.  The device is an Astron VLS-10M. I just blew the supply while trying to charge a 150F capacitor with the ...\r\n        "},
{"topic":"electronics","question":"Difference between Brushless Motor and Stepper Motor","excerpt":"I think I understand the operating principles of a brushless motor and a stepper motor, but I'm a little confused about the difference.  Is a brushless DC motor a very basic stepper motor?  With ...\r\n        "},
{"topic":"electronics","question":"Has anyone seen a Micro-USB socket which installs with the socket perpendicular to the PCB?","excerpt":"Has anyone seen a Micro-USB socket which installs with the socket perpendicular to the PCB?\n\nYou'd think that this would be readily available as a standard option but it seems to be hard to come by. ...\r\n        "},
{"topic":"electronics","question":"Parallel circuit","excerpt":"What happens if i connect 2 or more similar 12 volt and 5 amperage electrical adapters in parallel to a single load to avoid power outage and continuous power supply.\n\nVolt= 24 or 12\nAmp = 5 or 10\n\n...\r\n        "},
{"topic":"electronics","question":"Looking for a Micro-USB socket with the same external geometry as Mini-USB","excerpt":"I'm looking for a Micro-USB socket which has the same external size as a Mini-USB socket. This is to allow us to update some old products to use Micro-USB without us having to modify all the tools ...\r\n        "},
{"topic":"electronics","question":"memory space to implement 128-bit AES algorithm on 8 bit microcontroller [duplicate]","excerpt":"How to calculate(RAM and ROM) memory space needed to implement 128-bit AES algorithm on 8 bit microcontroller?\n\ngive some examples please...\n\r\n        "},
{"topic":"electronics","question":"Why do opposing magnetic fields in the same core cause the core to heat up?","excerpt":"I inherited a choke of an odd design, with two windings on the same core. Separately, each winding was about 30 uH. In series, they were about 90 uH. When used in a split-bus boost converter, one ...\r\n        "},
{"topic":"electronics","question":"Shared parameter for several modules (Verilog)","excerpt":"I want to define a parameter in Verilog in such a way that several modules will be able to use it.\n\nEach module is implemented in different file.\n\nCan it be done or should I (re)define this parameter ...\r\n        "},
{"topic":"electronics","question":"Basic transistor wiring","excerpt":"I'm trying to control a stepper motor using transistors to switch the different phases (am I using the correct terminology?) on and off at the correct times. I'm going to use my Raspberry Pi to do ...\r\n        "},
{"topic":"electronics","question":"Hacking a treadmill with Arduino?","excerpt":"I'd like to write a desktop app that would be able to automatically read all measurements off my treadmill, and to fully control the treadmill instead of the native dashboard.\n\nUnfortunately I know ...\r\n        "},
{"topic":"electronics","question":"How can I calculate the inductance of the primary of a transformer given a specific load on the secondary?","excerpt":"Inductance in the primary of a transformer decreases as the load on the secondary increases. How can I calculate the inductance of the primary coil? What if it was step up or one to one ratio? \n\r\n        "},
{"topic":"electronics","question":"Should I have to include photocoupler in SSR application circuit?","excerpt":"I'm designing simple circuit for ssr control.\n\nI reviewed some sort of related circuits and previous version of the product(our company's)\n\nMany of them are including photocoupler before S.S.R. ...\r\n        "},
{"topic":"electronics","question":"Attempting to determine power consumption","excerpt":"So I am attempting to determine if the battery I choose can power the devices I need. This is my first day doing anything with ohms and current and such. So go easy.\n\nI have:\n\n2000mAh battery\n\n45mA    ...\r\n        "},
{"topic":"electronics","question":"Orcad variables in text","excerpt":"Does Orcad Capture enable using variables to specify values that depends on the environment?\n\nFor example, I have many pages in my project, and each page/sheet contains a text that says \"sheet number ...\r\n        "},
{"topic":"electronics","question":"Disentangling ratsnest: reassigning pins","excerpt":"I've got a few digital pins that control various features of a MAX5318 DAC connected to headers. EAGLE makes a spaghetti nest out of the wiring, but I think I can make the wires not overlap each other ...\r\n        "},
{"topic":"electronics","question":"capacitor value substitution","excerpt":"I have an audio circuit im building from schematics. . The schematic calls for 30nF, 220nF, 6.8nF, 22nF, 5nF, and 2.2nF capacitors ...all of which I cannot find to order. . I even converted these ...\r\n        "},
{"topic":"electronics","question":"diference between RTOS and OS? [closed]","excerpt":"I am confused between real time operating systems and normal operating systems(windows etc). and please tell me android is rtos or os.\nsuggest some good books for it.\n\r\n        "},
{"topic":"electronics","question":"nrf24l01+, enhanced shockburst with two “masters”","excerpt":"I want to connect a Raspberry Pi to a handheld ARM MCU-based device which contains a display and some buttons to show information from the Pi and transmit commands. I want to use nrf24l01+ 2.4GHz ...\r\n        "},
{"topic":"electronics","question":"Brushless DC Motor - Sensoreless Startup Algorithm","excerpt":"I am trying to achieve speed control of a sensorless Brushless dc motor (Back Emf method). Initially its speed is zero so Back emf is zero, so there will be no feedback, in that case what do i do? \n ...\r\n        "},
{"topic":"electronics","question":"Why need more aperatures in microphone array?","excerpt":"I am tring to achieve delay sum beamforming with microphone array, for that I bought playstation eye camera which has 4 microphones in it. \n\nFor locationg the angle of the sound I need to find exact ...\r\n        "},
{"topic":"electronics","question":"Regarding Radio Frequency (RF) when a Receiver/Antenna Setup can receive DC - What Exactly Does that (DC) Mean?","excerpt":"I do not have a strong foundation in RF. I have been doing some research but I still do not properly grasp what it means if a receiver/antenna can do DC to X Hz. For example this Funcube Upconverter, ...\r\n        "},
{"topic":"electronics","question":"Torus shaped solenoid","excerpt":"I need to use one of those for an experiment (a solenoid with the shape of a torus). Unfortunately, as you can see, I don't know the appropriate name for it. I have built myself a temporary one but ...\r\n        "},
{"topic":"electronics","question":"Step-down transformer AC to DC voltage conversion problem?","excerpt":"I got a step down transformer from an old black and white CRT TV that is about 18v 0 18v, 10A AC current output. I wanted to convert AC to DC, so used four 1N4007 diodes as a bridge rectifier. When I ...\r\n        "},
{"topic":"electronics","question":"Is it ok to bend a VIA in a Flex Printed Circuit?","excerpt":"On a Flex Printed Circuit (FPC) made out of Kapton polyimide, will anything bad happen if I put a VIA in a part of the FPC that has to bend?\n\n\nVIA size: 0.2 mm hole diameter in 0.4 mm copper diameter\n...\r\n        "},
{"topic":"electronics","question":"Not getting pure sine wave in simulnik matlab","excerpt":"I should be getting a pure sine wave. But it shows sine wave that is peak at top, and not smooth.So what should be the error.\nIt shows following warning\n\n...\r\n        "},
{"topic":"electronics","question":"Problem with 555 timer and 4017 counter","excerpt":"simulate this circuit – Schematic created using CircuitLab\n\nI'm attempting to make a circuit that flashes each LED sequentially. So far my 555 timer works just fine and gives me a pulse ...\r\n        "},
{"topic":"electronics","question":"Double sided board w/ d2paks, solder paste?","excerpt":"Can you use paste on a double-sided board w/ d2paks on both sides? There is a small area below the tab but it seems like not really enough room for paste.  If not, then how the heck do you do a double ...\r\n        "},
{"topic":"electronics","question":"How does a digital sound card's electric circuit make different pitches, etc. measured in just electrons? [closed]","excerpt":"I was wondering how hardware engineers, electrical engineers, or any and all inbetween design a circuit diagram for something that measures pitches, tones, etc. all in the form of bits/bytes and ...\r\n        "},
{"topic":"electronics","question":"What are some interesting sensors? [closed]","excerpt":"I'm becoming more or less an electronics hobbyist. I work with digital electronic stuff. I have a Hawkboard, Beagleboard and Arduino which generally have multiple digital or analog input lines. I was ...\r\n        "},
{"topic":"electronics","question":"How to build PID controller that able to synchronise the encoder-motor speed? [closed]","excerpt":"i am a freshman in arduino and PID world.\n\nI'd like to ask if i want to build a PID controller that able to adjust the 2 motors' speed(integrated encoder motor).what are the accessorise that i have to ...\r\n        "},
{"topic":"electronics","question":"What is the minimum current a current transformer can sense?","excerpt":"Datasheet of AS-100 mentions a maximum current it can sense before saturation, but what is the minimum current it can sense.\n\nFor instance, if I put 10 mA 50Hz through a conductor passing through the ...\r\n        "},
{"topic":"electronics","question":"Simple state machine with latching inputs is confusing me","excerpt":"Okay so this is a question for school, I am not expecting someone to give me the full thought out answer, I just need someone to point me in the right direction as I am confused and my tutor is off on ...\r\n        "},
{"topic":"electronics","question":"NPN transistor seams to be “leaking” in simulation. What is wrong with my circuit?","excerpt":"I am kind of new to electronics, and I am eager to learn how to work with transistors; especially in realizing logic gates with them. I tried to build a very basic circuit with a transistor as my ...\r\n        "},
{"topic":"electronics","question":"7 Segment Display [closed]","excerpt":"I'm new to circuits and I'm really lost, I would really appreciate your help. I have Switch 1, and Switch 2. when i connect my battery (9v) to voltage regulator switch 1 light up Led Segment B, and ...\r\n        "},
{"topic":"electronics","question":"Non-wet open solder fault on the same ball of two different devices of the same part?","excerpt":"Sophisticated PCBA, with a DM6446 using two 16 bits DDR2 devices to implement a 32 bit memory space. On some boards, we see a stuck bit on either bit 24 or bit 8, which map to the same BGA ball (C8) ...\r\n        "},
{"topic":"electronics","question":"Effect of a transistor on a voltage divider? (or vice versa)","excerpt":"I'm learning about transistors and am trying to make a basic circuit that uses a photoresistor as a sensor to turn an LED on and off depending on light conditions (the 150kOhm resistor is where the ...\r\n        "},
{"topic":"electronics","question":"What parts would one typically use for automated PCB testing?","excerpt":"I have a circuit board in production, primarily through-hole, to the tune of ~400 units per year. Each one is manually inspected and tested. The board has ten distinct voltage rails, four voltage ...\r\n        "},
{"topic":"electronics","question":"UART receive only works if I have a oscope or voltmeter attached to it","excerpt":"I designed a board to interface the CEL MeshConnect Mini Zigbee module with a lighting controller board.  The Zigbee module is able to transmit bytes via UART and I've verified this, but the radio ...\r\n        "},
{"topic":"electronics","question":"GFCI with energized neutral [migrated]","excerpt":"How well will a GFCI circuit be able to detect current flows, if both the \"hot\" input and the (supposedly) \"neutral\" input to a GFCI outlet are energized?\n\nThe reason I am interested in this is that I ...\r\n        "},
{"topic":"electronics","question":"GSM/GPRS AT command - hitting a link","excerpt":"I am trying to target a specific page (script) on my webserver using a GPRS modem. I can hit my domain, and get a reply back but then when I am trying to call my script it just won't let me:\n\n...\r\n        "},
{"topic":"electronics","question":"Where does all the power consumed by a CPU go?","excerpt":"Where does all the power consumption of a CPU go? Does all the power drawn by the PC's CPU get transformed into heat? Or does it get transformed into part heat and part some other kind of energy?\n\r\n        "},
{"topic":"electronics","question":"PSU: Is the DC load current the same measurement as the combined amperage output","excerpt":"In selecting the right Power supply unit for high performance system, I have learned that besides the watt all the amperage is an important measurement. The following site provided information or ...\r\n        "},
{"topic":"electronics","question":"Calculating the value of bypass capacitors for an amplifier","excerpt":"I want to know if there is a rough any ready way of calculating the capacitance required to decouple the power supply used in an amplifier. (Rough and ready because I'll be adding 30% to the value ...\r\n        "},
{"topic":"electronics","question":"Why switching cause EMI &amp; noise problem?","excerpt":"I was reading an article topic on \"Selecting the correct IC for power supply applications\" in which it tells the different types of topology and their pros and cons.In that, it list out the three ...\r\n        "},
{"topic":"electronics","question":"What is Manhattan routing?","excerpt":"In an answer by The Photon he mentions 'Manhattan routing' in regards to PCB design. I haven't found a lot of relevant information about this term on the internet; therefore the question: What is ...\r\n        "},
{"topic":"electronics","question":"PIC : Internal RTC stop when i read time during some operation","excerpt":"Hi I am using PIC18f67k22 controller.I am using internal RTC.\n  I am try to read RTC time at start of RTC. After some time read back time of RTC and  It was fine but problem is when i am reading ...\r\n        "},
{"topic":"electronics","question":"Ways to build a speedometer for a bike or skateboard","excerpt":"I'm trying to think of different ways to build a device that will allow me to mount it to any moving object so that the moving object will be able to discern it's speed (It DOES NOT have to be very ...\r\n        "},
{"topic":"electronics","question":"When talking about antenna gain (dBi), is the largest gain implied?","excerpt":"Since shouldn't dBi gain vary depending on radial location?\n\r\n        "},
{"topic":"electronics","question":"Using a 12V battery while simultaneously charging via solar panel","excerpt":"I have a couple of 12v batteries that I'd like to use to power a cooling apparatus while camping for several days.\n\nI also have a 15W solar panel I'd like to use to top-off the battery.\n\nCan I use the ...\r\n        "},
{"topic":"electronics","question":"Amplifier analog design - how to effectively do it when gain varies so much?","excerpt":"For example, I was thinking about building a small current sensing device that has an display to measure small current draws on some of my circuits. The design would be such that a very small ...\r\n        "},
{"topic":"electronics","question":"3.3 v TLL to RS232 (To Connect Pic with PC)?","excerpt":"Is there any ic like MAX232 that can level shift 3.3v TLL to RS232?\n\nI need it to debug a pic running on 3.3 V with my pc.\n\r\n        "},
{"topic":"electronics","question":"Microcontrollers - are the output states constant or multiplexed?","excerpt":"PWM obviously require computing resources(and thus cannot be done simultaneously with other processes), but if I were to set a pin as output 5V or 0V, do these states remain constant or are they ...\r\n        "},
{"topic":"electronics","question":"Correct way to define propagation delays in VHDL","excerpt":"I'm currently learning VHDL. As an exercise I decided to implement some of the 7400 series chips. Below is the 74153 and while testing it with ghdl/gtkwave it seems to work.\n\nBut I'm sure this ...\r\n        "},
{"topic":"electronics","question":"Joining fine wires","excerpt":"Ive got a postage scale, on which that the 9v battery connector has fallen off, i bought a new one online for £1 (as below), the new one already has cables coming out of it and the postage scale has ...\r\n        "},
{"topic":"electronics","question":"are amplifier and attentuator bascially of the similiar function?","excerpt":"I just got a very old function generator (I can't even tell the manufacture and the model number) to produce sine wave. I open it and see a big module label video amplifier. The function generator ...\r\n        "},
{"topic":"electronics","question":"Why did a DVB-T antenna cable give me an electric shock? [closed]","excerpt":"It might be a silly question, but I've just got an electric shock from a TV antenna cable (coaxial) and really can't figure out why it happened. I touched the cable at a connector-cable junction and ...\r\n        "},
{"topic":"electronics","question":"How to get consistent codes from IR receiver module TSOP1738","excerpt":"I'm doing some experiments with a TSOP1738 receiver module. I picked up a small 'remote control' (aka an IR transmitter) from my car audio system and I'm trying to send some command over to a robot. I ...\r\n        "},
{"topic":"electronics","question":"FT230X Baud Rate Aliasing","excerpt":"I'm using a FT230X UART, and I'd like to use it with a non-standard baud rate. I came accross this note, explaining that I have to modify the driver file, but even with this documentation I have some ...\r\n        "},
{"topic":"electronics","question":"LED control using GPIO [closed]","excerpt":"I am using an industrial camera that has GPIO ports which I would like to use for turning LED plate off and on. LED runs on 24 V and 350 mA (between 350 mA and 1500 mA but 350 mA would be optimal). \n\n...\r\n        "},
{"topic":"electronics","question":"How can I switch a high-side transistor from logic referenced to ground?","excerpt":"Problem: I have a logic signal (represented by SW1), say from a microcontroller, that is either 0V or some low voltage, maybe 5V or 3.3V. I have a higher voltage supply (V1) and a switching device ...\r\n        "},
{"topic":"electronics","question":"Design a full subtractor using 4 to 1 MUX and an inverter","excerpt":"I can't wrap my head around it. Any tips?\n\nI need to draw a circuit diagram of a Full Subtractor using 4-to-1 Multiplexers and an Inverter.\n\nFS diagram:\n\n\n\nMUX diagram:\n\n\n\nDo I need to combine them ...\r\n        "},
{"topic":"electronics","question":"I have no UART on my microcontroller so how can I add one?","excerpt":"I am using a ATMEGA32HVB microcontroller which has a facility for cell balancing by which we can connnect 4 batteries in series and use one at a time. That is  very useful for power management so I ...\r\n        "},
{"topic":"electronics","question":"How to re-solder fine broken flex cable connection to pcb","excerpt":"I have a phone where the volume button button flex cable has been partially pulled away from the PCB. See this photo for what it would have looked like before being damaged:\n\n...\r\n        "},
{"topic":"electronics","question":"Does spartan 6 XC6SLX9 FPGA have an internal oscillator ? .If so how to access that?","excerpt":"I am new to this FPGA. can any one help with the following :\n\nDoes Spartan 6 XC6SLX9 have an internal oscillator ?. If so what are its specifications ? , how can i access that ? . Please share any ...\r\n        "},
{"topic":"electronics","question":"MOSFET based switch for high voltages","excerpt":"I'm struggling with the design of a MOSFET based switch for high input voltages.\nSee schematic of the basic circuit that I've come up with:\n\n\n\n\n\n\n\nsimulate this circuit – Schematic created using ...\r\n        "},
{"topic":"electronics","question":"USB ASCII input without ICs? [closed]","excerpt":"I think I have the basic knowledge to build an 8-bit controller consisting of 8 buttons and logic gates to give out an 8-bit signal. My problem is, I have 9 outputs without counting 0 or 9. That is ...\r\n        "},
{"topic":"electronics","question":"Micro-scale solar thermal power","excerpt":"Are there any practical methods of converting solar thermal energy into electrical power on very small scales, eg: using a 300mm diameter paraboloid reflector with temperatures of approximately ...\r\n        "},
{"topic":"electronics","question":"USB Control of WS2801 LEDs","excerpt":"I have a string of WS2801 LEDs (the type most often used with an Arduino or Raspberry Pi over SPI), as well as an evaluation kit/breakout board for USB-to-SPI-master (MCP2210).\n\nHowever, I am more of ...\r\n        "},
{"topic":"electronics","question":"Control 9.6v battery line (on/off) with a 5v I/O pin?","excerpt":"I would like to control a DC 9.6v battery line (on/off) with a 5v digital I/O pin on a little microcontroller. I think the best way to do it is using a small relay (something like this), but I'm not ...\r\n        "},
{"topic":"electronics","question":"Are the ratings on a bench supply absolute or do they imply total power output?","excerpt":"If a bench supply is rated as \"30V, 5A\", does that does that imply a 150W total output (meaning it could supply say, 10A at 15V), or does it mean that 5A is the maximum it can supply at any voltage in ...\r\n        "},
{"topic":"electronics","question":"Lextool 908 soldering station - compatible spare parts?","excerpt":"I have a  Lextool 908 Soldering station with both soldering iron and hot air exhaust broken and unrepairable. So I'm in the market for spare parts. \n\nHowever, I can't find anything when searching for ...\r\n        "},
{"topic":"electronics","question":"Changing my fluorescent lamp to led lamp","excerpt":"I am planning to design a LED lamp using a 6V power supply from a lead-acid battery with a rating of 4.5Ah. I want to connect 20 LEDs  (LED's rating is 20mA 2V) in parallel to achieve maximum ...\r\n        "},
{"topic":"electronics","question":"Zener Noise Generator - NPN BJT Amplifier Analysis","excerpt":"I'm interested in creating a low voltage white noise generator by means of a zener diode, as detailed here: Zener &amp; BJT Noise Generator.  Specifically, I want to use the circuit here, in order to ...\r\n        "},
{"topic":"electronics","question":"Power El wire from Mains","excerpt":"I have been looking at EL wire inverter, and most are battery powered.\nI want to power it from mains power.\n\nI was looking at having a transformer to step down from 220AC to 110AC.\nThis gives me 110AC ...\r\n        "},
{"topic":"electronics","question":"not sure how to draw the nandgate schematics for my segment display","excerpt":"I recently was suppose to do this question:\n\n\n\n\n\nThe above is what I have done and I am stuck, wondering if anyone knows how to draw out the nand gate schematic diagram based on my 5 karnaugh maps.\n\r\n        "},
{"topic":"electronics","question":"6V LDO regulator for 6A peak motor","excerpt":"I'm looking for an adjustable or fixed 6V regulator, performing up to 6A peak current. The continuous consumption will be much smaller. It needs to be a LDO regulator, since I will be powering the ...\r\n        "},
{"topic":"electronics","question":"Can I use devices with different unit loads on the same bus? If not, why?","excerpt":"I've been having trouble getting a rs485 communications bus working with some external devices. I have an Arduino hooked up to a MAX487ECSA+ which goes through some cabling to my devices. Using an ...\r\n        "},
{"topic":"electronics","question":"Step Voltage Down","excerpt":"I have an Arduino and several Strings of LEDs being powered by a wall wort. The LED portion is fine as is, however the Arduino has an ethernet shield attached and it is getting very hot when on. The ...\r\n        "},
{"topic":"electronics","question":"Eagle PCB duplicating parts","excerpt":"I've recently designed a FPGA breakout board using an FPGA BGA package, and due to the lack of packages I had on hand, I got the BGA-256 and drew new symbols and updated the connections from scratch.\n\n...\r\n        "},
{"topic":"electronics","question":"Choosing transistor for a raspberry pi switch","excerpt":"I'm trying to design a circuit that will control the power to a raspberry pi with a button. The basic usage is: \n\n\nfirst button press-&gt; rasp powers up.  \nsecond button press-&gt; rasp continues with ...\r\n        "},
{"topic":"electronics","question":"Wireless data acquisition for PC","excerpt":"I’m looking for an off the shelf device to send a serial stream of data (low speed ok) wirelessly to a PC.  I’m guessing the easiest way is through a comm port or USB port.  Distance is less than 25 ...\r\n        "},
{"topic":"electronics","question":"Maintain multiple connection intervals/slave latencies in Bluetooth Low Energy network","excerpt":"Is it possible for a Bluetooth Low Energy network to operate with two different connection intervals and slave latencies?\n\nTo clarify, assume I have a network with one host and two slaves. These ...\r\n        "},
{"topic":"electronics","question":"using relay to switch between video outputs","excerpt":"Hey all I have a simple question... would I be able to send a video signal (composite) to each relay per camera? Reason being is that I only have one video input but need to be able to use 2 cameras ...\r\n        "},
{"topic":"electronics","question":"Simulating Charged Capacitor","excerpt":"Is there any in built mechanism to simulate a charged capacitor in simulation software like Multisim or Proteus?\n\nIf not, is there any alternative method for simulation of partially charged ...\r\n        "},
{"topic":"electronics","question":"Raspberry Pi camera feed is slow [migrated]","excerpt":"I managed yesterday to hook my \"LifeCam VX-800\" to my Raspberry Pi. It works just fine, but it's very very slow. I tried adjusting that by decreasing the sleep duration in the code, but that didn't ...\r\n        "},
{"topic":"electronics","question":"Suggestions for use of 320V 100W solar panel? [closed]","excerpt":"I have recently acquired a 100Watt 320VDC (429VOC) flexible solar panel which I would like to use on my boat. I may buy more of these panels if I can find an affordable way to use them.\n\nThe cost of ...\r\n        "},
{"topic":"electronics","question":"The flyback diode and its applications","excerpt":"So in an application like this:\n\n\n\nThe coil of the motor will, by Lenz's Law, induce a very large negative voltage across its terminals (without the diode in place). Would this voltage be very ...\r\n        "},
{"topic":"electronics","question":"Stuck in bluetooth module HC-06","excerpt":"I have a problem with ATmode in this module. I want to change baud rate and device's name, so I using an app Android \"Bluetooth SPP\" to pair with module and send ATcommand, but it doesnt reply when I ...\r\n        "},
{"topic":"electronics","question":"What is wrong with my arduino code? [closed]","excerpt":"I have created a project for basic ethernet shield and JAVA program communication. When I try to compile the code I get a error:\n\n...\r\n        "},
{"topic":"electronics","question":"Having trouble with L298N H-Bridge IC","excerpt":"I cannot understand how this IC works from the block diagram given in the datasheet. I understand the concept of an H-bridge, but cannot figure how this one operates. \n\nI drew on the schematic to ...\r\n        "},
{"topic":"electronics","question":"Is it important to determine the type of solder used on a board, and if so, how?","excerpt":"I'm asking this in the context of desoldering consumer PCBs, with lead vs. lead-free solder. My concern is twofold:\n\n\nlead-free solder usually has a higher melting point, so the temperature should be ...\r\n        "},
{"topic":"electronics","question":"High-voltage programming of ATTiny13 with AVRISPmkII and avrdude?","excerpt":"I am in the process of learning on how to program ATTiny13-20pu, and am reading this post: http://www.vk2zay.net/article/211 (archived: http://www.webcitation.org/6Imwjmidx ), which explains how to do ...\r\n        "},
{"topic":"electronics","question":"which ac-dc adapter work with my device? [duplicate]","excerpt":"lets say I loose the acdc adapter of a device, like a laptop or a wireless router, how do you know that another adapter will work with my device? my assumption is that I have to match the same voltage ...\r\n        "},
{"topic":"electronics","question":"Vin output voltage of an Arduino","excerpt":"I have got a very simple and fast question.\nI have connected 6v to the power jack of my arduino, and when I tested the output voltage from the Vin, it turns to be 5.3v with no connection and 4.8 with ...\r\n        "},
{"topic":"electronics","question":"DC voltages at long distance from battery","excerpt":"I have 12 volt and 135 ampere battery. Now I want to connect a device approximately 300 feet away from the battery.\n\nWhen I connect it at this distance, my device does not work. When I connect the ...\r\n        "},
{"topic":"electronics","question":"Accelerometer selection? [closed]","excerpt":"I would like to design a circuit which when moves should give out a voltage. So I would like to choose an accelerometer for this application. I wish to go for single-axis accelerometer which is quite ...\r\n        "},
{"topic":"electronics","question":"How can I tell if an RF transmitter is transmitting?","excerpt":"In my project, I use a use an RF Transmitter and Receiver. One of the RF components seemed to fail because the connection between my Arduinos no longer works. I cannot determine whether the RF ...\r\n        "},
{"topic":"electronics","question":"How can I tell if my battery is damaged physically?","excerpt":"I have boughten a rechargeable battery and a charger a few months ago and when I received it, I briefly hooked it up to a multimeter and shoved it in the back of a drawer to use on another project ...\r\n        "},
{"topic":"electronics","question":"Modes in waveguides","excerpt":"What is the meaning of Modes in waveguide? With what physical property of the Electromagnetic wave does it deal with? I have just started with parallel plane waveguide and in that case the constant m- ...\r\n        "},
{"topic":"electronics","question":"Possible wifi interference with processor","excerpt":"I am building a device that consists of an ordinary WiFi router (WDR4300) as shown here:\n\n\n\nWhich works as a client and scans for networks OK when alone. The problems appear when I add another board ...\r\n        "},
{"topic":"electronics","question":"What's one way for recognizing an object (pre guidance for making a device)?","excerpt":"I want to make a device that will recognize an object, for example: cube, sphere etc. I have two sensors that make a pulse for measuring distance between the sensor and an object as shown in this ...\r\n        "},
{"topic":"electronics","question":"How would one determine the impedance of a catenary end-fed antenna?","excerpt":"I'm thinking of having a weather balloon haul high-gauge (35SWG or higher) antenna. Then play with using it atleast for reception on the long waves. \n\nThe wire certainly won't be vertical; I expect it ...\r\n        "},
{"topic":"electronics","question":"How do I design a circuit for a bi-color led to display power?","excerpt":"I'm trying to create a simple circuit that will turn a Red/Green LED green when the power is on and red when it is off. I figure the simplest way to do this would be using a SPDT switch, but the ...\r\n        "},
{"topic":"electronics","question":"Trouble finding suitable Op-amp","excerpt":"I need to find a op-amp that will handle the high input voltages that my circuit requires.  I'm not real familiar with them and not sure how to read their datasheets.  I do have a LM741 but it looks ...\r\n        "},
{"topic":"electronics","question":"Connect Bluetooth module to PIC16F877A","excerpt":"I have a PIC16F877A micro-controller. I need to interface a Bluetooth module with PIC. It will be connectted using UART Serial Communication. I have read the datasheet but couldn't find which exact ...\r\n        "},
{"topic":"electronics","question":"What is the function of the bulb in a Wien bridge oscillator?","excerpt":"In this answer it is said that the bulb in a Wien bridge oscillator is for temperature compensation. \n\n\n\nIs that true? (I thought it is a kind of AGC to stabilize the output level.)\n\r\n        "},
{"topic":"electronics","question":"dsPIC33 vs PIC32","excerpt":"I originally thought the advantage of PIC32 was the ability to handle more sophisticated RTOS, like ones that are linux based. Unfortunately  it lacks a Memory Management Unit (MMU) and enough ram.\n\n...\r\n        "},
{"topic":"electronics","question":"What's The fundamental difference between interrupts and delay in embedded programming?","excerpt":"I'm new in embedded programming in C, just getting to understand coding.\nIs there a fundamental difference between an interrupt function and a delay function?\n\nI would greatly appreciate answers with ...\r\n        "},
{"topic":"electronics","question":"controlling 2 kw,230v- infra red short wave heaters using electronic device","excerpt":"i want to control infra red short wave heaters 230v,2kw, with some electronic device,\nit is an open loop system,where i want to give analog signal to heater from 0 to 100% .\ni cant take Thermocouple ...\r\n        "},
{"topic":"electronics","question":"Performance of solar panel vs. DC power supply","excerpt":"I am building a solar swamp cooler for burning man (hot dry desert environment).\n\nPurchased a 15w solar panel that outputs 0.9a at 20V in full sun (verified as true with my voltmeter). The solar panel ...\r\n        "},
{"topic":"electronics","question":"Why does the voltage changes in this simple circuit?","excerpt":"I'm beginning to learn electronics, and there's something I just can't grasp. I was told that a high resistance in a circuit would lead to a smaller current passing through it, but the voltage would ...\r\n        "},
{"topic":"electronics","question":"How do I figure out the correct polarity of a DC barrel connector","excerpt":"I'm in the U.S. and I bought a digital wall clock from the U.K. which came with an AC adapter with input 230V/50Hz/90mA and output 9V/800mA. Now I could get a transformer to convert 120V to 230V but ...\r\n        "},
{"topic":"electronics","question":"AVRISP mkii not reading device signature","excerpt":"I recently bought a dozen ATtiny85 MCUs and I was trying to test one simply by putting a blink program on it via the Arduino IDE with and AVRISP mkii (Arduino 1.0.5, Ubuntu 13.04). I kept getting an ...\r\n        "},
{"topic":"electronics","question":"Extracting the Square Root of a Voltage","excerpt":"I'm trying to discover a circuit that will produce a voltage which is some factor of the square root of the input voltage. I.e. \\$V_{out}(t) = K\\sqrt{V_{in}(t)}\\$. The factor K is irrelevant.\n\nI ...\r\n        "},
{"topic":"electronics","question":"MSP430 ADC least significant bits always 1","excerpt":"I have an MSP430F2618 with built in 12-bit ADC, but for some reason the values it returns always end with the 2 least significant bits set to 1, except when it zeroes out. In other words, the counts ...\r\n        "},
{"topic":"electronics","question":"Need help with circuit design for current measurement of car starter","excerpt":"Okay I want to make a simple circuit to measure high currents coming from my car battery, and I think I have something that might work, but I'd like anyone who knows more about this to point me in the ...\r\n        "},
{"topic":"electronics","question":"Voltage drop on cable","excerpt":"I was trying to measure voltage drop caused by length of cables. I generated short high frequency voltage pulse (&gt;200kHz, 70V) and compared the voltage on the generator with the voltage at the end of ...\r\n        "},
{"topic":"electronics","question":"how to drive peltier cooler pad at home?","excerpt":"I purchased an peltier cooler plate (90W maximum, but it could work at different power) like the model shown in this link http://pcbheaven.com/wikipages/The_Peltier_Thermo-Element/ . It has a wide ...\r\n        "},
{"topic":"electronics","question":"Finding state diagram of circuit with two T flip flops","excerpt":"I want to find the state diagram of this circuit, there is no input and output.\n\n\nI need to use Excitation table? I would like to get some suggestions.\nThanks!\n\r\n        "},
{"topic":"electronics","question":"Tips on ESD protection for hobbyist designs","excerpt":"I'm finally getting into simple PCB design for my personal projects, and I'm concerned about ESD protection on exposed parts of my board like USB ports. I know how wrist straps work and I understand ...\r\n        "},
{"topic":"electronics","question":"How do I interface to this flexible flat cable connector?","excerpt":"I've noticed this connector on a lot of boards, and I was wondering if anyone knew where to source them? I can't seem to find them on digikey.com anywhere. What I'd really like is to get a male ...\r\n        "},
{"topic":"electronics","question":"How are wires placed inside extending single-wire headphones?","excerpt":"I'd like to know how wires are placed inside the part that connects left and right ear pieces together that allows them to extend significantly without any problems.\n\nHere's the type of the headphones ...\r\n        "},
{"topic":"electronics","question":"Are there any ATxmega chips with bi-directional SPi ports?","excerpt":"I searched the datasheets shown for the ATxmega chips in the Microcontroller Selector, shown on the left side of http://www.atmel.com/products/microcontrollers/default.aspx, for any ATxmega chips with ...\r\n        "},
{"topic":"electronics","question":"Signal to the audio jack of a smart phone","excerpt":"I have a 3.3 V square wave that consists of groups of 5 pulses at either 12.5 khz and 15.625 khz. Each group of 5 pulses represents either a 1 or a 0. I would like this signal to be passed to a ...\r\n        "},
{"topic":"electronics","question":"Erasing a microcontroller","excerpt":"Just wondering that,is it possible to write a self-erasing program for a MCU (suppose pic16f877a)? If so can anybody please help me?\n\r\n        "},
{"topic":"electronics","question":"Does ferrous/non-ferrous matter for ground planes?","excerpt":"I'm wondering about the best materials for making a ground plane. I've found some websites that claim that non-ferrous materials (i.e. aluminum) are generally poor ground planes (or at least not as ...\r\n        "},
{"topic":"wordpress","question":"Lost of query parameter when using permalink","excerpt":"I have many issues with the use of rewriting, but i'll just point out one in this post to be specific.\n\nIn my theme i use custom post type, with custom taxonomy\n\nfunction custom_post_realisation() {\n  ...\r\n        "}
]
